Dlubal.RFEM5.ISurface
Interface for working with surface

Dlubal.RFEM5.ISurface.GetData
Gets surface parameters.
Returns: Surface parameters

Dlubal.RFEM5.ISurface.SetData(System.UInt32@)
Sets surface parameters.
Surface: Surface parameters

Dlubal.RFEM5.ISurface.Delete
Deletes surface.

Dlubal.RFEM5.ISurface.GetGrid
Gets surface grid parameters.
Returns: Surface grid parameters

Dlubal.RFEM5.ISurface.SetGrid(System.UInt32@)
Sets surface grid parameters.
Grid: Surface grid parameters

Dlubal.RFEM5.ISurface.GetInputAxes
Gets surface axes for input.
Returns: Axis for input parameters

Dlubal.RFEM5.ISurface.SetInputAxes(System.UInt32@)
Sets surface axes for input.
Axes: Axis for results parameters

Dlubal.RFEM5.ISurface.GetResultAxes
Gets surface axes for results.
Returns: Parameters of axis for results

Dlubal.RFEM5.ISurface.SetResultAxes(System.UInt32@)
Sets surface axes for results.
Axes: Parameters of axis for results

Dlubal.RFEM5.ISurface.GetLocalCoordinateSystem(System.UInt32@)
Gets surface local coordinate system.
Returns: Local coordinate system interface
Point: Point on the surface

Dlubal.RFEM5.ISurface.GetVariableThickness
Gets surface variable thickness.
Returns: Variable thickness interface

Dlubal.RFEM5.ISurface.GetOrthotropicThickness
Gets surface orthotropic thickness.
Returns: Orthotropic thickness interface